Revit 2027 API
FabricSheet.BentFabricBendDirection Property
 Specifies which wire direction of the fabric sheet is bent.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BentFabricBendDirection BentFabricBendDirection { get; set; }
Public Property BentFabricBendDirection As BentFabricBendDirection
	Get
	Set
public:
property BentFabricBendDirection BentFabricBendDirection {
	BentFabricBendDirection get ();
	void set (BentFabricBendDirection value);
}
member BentFabricBendDirection : BentFabricBendDirection with get, set
Property Value
BentFabricBendDirection
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidObjectException |  When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Remarks
 This parameter applies only to bent fabric sheets.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace